{"class_name": "Model", "config": {"output_layers": [["dense_3", 0, 0], ["dense_3", 1, 0], ["dense_3", 2, 0], ["dense_3", 3, 0], ["dense_3", 4, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50, 41], "sparse": false, "dtype": "float32", "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "return_sequences": true, "go_backwards": false, "stateful": false, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "use_bias": true, "implementation": 1, "recurrent_dropout": 0.0, "dropout": 0.0, "name": "lstm_1", "bias_constraint": null, "return_state": false, "activity_regularizer": null, "kernel_constraint": null, "activation": "tanh", "units": 32, "unit_forget_bias": true, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "recurrent_activation": "hard_sigmoid"}}, "trainable": true, "merge_mode": "concat", "name": "bidirectional_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "bidirectional_1"}, {"class_name": "Lambda", "config": {"arguments": {}, "function_type": "lambda", "output_shape_type": "raw", "name": "LAMBDA1", "function": ["4wEAAAAAAAAAAQAAAAQAAAATAAAAcyMAAAB0AABqAQBkAQB0AABqAgB8AACDAQBkAgAZiAAAZgIA\ngwABUykDTtoFc2hhcGXpAAAAACkD2gFL2gV6ZXJvc3IBAAAAKQHaAVgpAdoDbl9oqQD6HjxpcHl0\naG9uLWlucHV0LTgtNDc4NGE5ZDI3N2IzPtoIPGxhbWJkYT4QAAAAcwAAAAA=\n", null, [64]], "output_shape": null, "trainable": true}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "name": "LAMBDA1"}, {"class_name": "RepeatVector", "config": {"trainable": true, "n": 50, "name": "repeat_vector_1"}, "inbound_nodes": [[["LAMBDA1", 0, 0, {}]], [["lstm_2", 0, 0, {}]], [["lstm_2", 1, 0, {}]], [["lstm_2", 2, 0, {}]], [["lstm_2", 3, 0, {}]]], "name": "repeat_vector_1"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_1"}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 0, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 1, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 2, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 3, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 4, 0, {}]]], "name": "concatenate_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_constraint": null, "activation": "tanh", "kernel_regularizer": null, "units": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "trainable": true, "name": "dense_1", "activity_regularizer": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]], [["concatenate_1", 1, 0, {}]], [["concatenate_1", 2, 0, {}]], [["concatenate_1", 3, 0, {}]], [["concatenate_1", 4, 0, {}]]], "name": "dense_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "trainable": true, "name": "dense_2", "activity_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]], [["dense_1", 1, 0, {}]], [["dense_1", 2, 0, {}]], [["dense_1", 3, 0, {}]], [["dense_1", 4, 0, {}]]], "name": "dense_2"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "attention_weights"}, "inbound_nodes": [[["dense_2", 0, 0, {}]], [["dense_2", 1, 0, {}]], [["dense_2", 2, 0, {}]], [["dense_2", 3, 0, {}]], [["dense_2", 4, 0, {}]]], "name": "attention_weights"}, {"class_name": "Dot", "config": {"axes": 1, "trainable": true, "normalize": false, "name": "dot_1"}, "inbound_nodes": [[["attention_weights", 0, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights", 1, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights", 2, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights", 3, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights", 4, 0, {}], ["bidirectional_1", 0, 0, {}]]], "name": "dot_1"}, {"class_name": "Lambda", "config": {"arguments": {}, "function_type": "lambda", "output_shape_type": "raw", "name": "LAMBDA2", "function": ["4wEAAAAAAAAAAQAAAAQAAAATAAAAcyMAAAB0AABqAQBkAQB0AABqAgB8AACDAQBkAgAZiAAAZgIA\ngwABUykDTtoFc2hhcGXpAAAAACkD2gFL2gV6ZXJvc3IBAAAAKQHaAVgpAdoDbl9oqQD6HjxpcHl0\naG9uLWlucHV0LTgtNDc4NGE5ZDI3N2IzPtoIPGxhbWJkYT4RAAAAcwAAAAA=\n", null, [64]], "output_shape": null, "trainable": true}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "name": "LAMBDA2"}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "return_sequences": false, "go_backwards": false, "stateful": false, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "use_bias": true, "implementation": 1, "recurrent_dropout": 0.0, "dropout": 0.0, "name": "lstm_2", "bias_constraint": null, "return_state": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "tanh", "units": 64, "unit_forget_bias": true, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "recurrent_activation": "hard_sigmoid"}, "inbound_nodes": [[["dot_1", 0, 0, {}], ["LAMBDA1", 0, 0, {}], ["LAMBDA2", 0, 0, {}]], [["dot_1", 1, 0, {}], ["lstm_2", 0, 0, {}], ["lstm_2", 0, 2, {}]], [["dot_1", 2, 0, {}], ["lstm_2", 1, 0, {}], ["lstm_2", 1, 2, {}]], [["dot_1", 3, 0, {}], ["lstm_2", 2, 0, {}], ["lstm_2", 2, 2, {}]], [["dot_1", 4, 0, {}], ["lstm_2", 3, 0, {}], ["lstm_2", 3, 2, {}]]], "name": "lstm_2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_constraint": null, "activation": "softmax", "kernel_regularizer": null, "units": 11, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "trainable": true, "name": "dense_3", "activity_regularizer": null}, "inbound_nodes": [[["lstm_2", 0, 0, {}]], [["lstm_2", 1, 0, {}]], [["lstm_2", 2, 0, {}]], [["lstm_2", 3, 0, {}]], [["lstm_2", 4, 0, {}]]], "name": "dense_3"}], "name": "model_1"}, "backend": "tensorflow", "keras_version": "2.2.2"}